EditorConfig.EditorConfig
Gruntfuggly.todo-tree
VisualStudioExptTeam.intellicode-api-usage-examples
VisualStudioExptTeam.vscodeintellicode
bierner.markdown-preview-github-styles
dbaeumer.vscode-eslint
dracula-theme.theme-dracula
eamodio.gitlens
esbenp.prettier-vscode
kumar-harsh.graphql-for-vscode
ms-azuretools.vscode-docker
ms-pyright.pyright
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.remote-explorer
richie5um2.vscode-sort-json
timonwong.shellcheck
vscodevim.vim
wix.vscode-import-cost
